admbase/src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТоваров</name>
  <basedOn>Document.ИнвентаризацияТоваров</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиПродуктовНаСкладах</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ИнвентаризацияТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/AccumulationRegisters/ОстаткиПродуктовНаСкладах/ОстаткиПродуктовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродуктовНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

admbase/src/Documents/ИнвентаризацияТоваров/ИнвентаризацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияТоваров</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/Documents/ОприходованиеТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияТоваров") Тогда
		
		 ЗаполнитьПоИнвентаризации(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	#Область ТекстЗапроса
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОприходованиеТоваров.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОприходованиеТоваров.МестоХранения КАК МестоХранения,
	|	ОприходованиеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ОприходованиеТоваровТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|		ПО ОприходованиеТоваровТовары.Ссылка = ОприходованиеТоваров.Ссылка
	|ГДЕ
	|	ОприходованиеТоваровТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОприходованиеТоваровТовары.НомерСтроки";
	
	#КонецОбласти
	
	
	Движения.ОстаткиПродуктовНаСкладах.Записывать = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОстаткиПродуктовНаСкладах.Добавить(),Выборка)
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоИнвентаризации(ДанныеЗаполнения) 

	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнвентаризацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	ИнвентаризацияТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ИнвентаризацияТоваровТовары.КоличествоФакт - ИнвентаризацияТоваровТовары.Количество КАК Количество,
	|	 ИнвентаризацияТоваровТовары.ВесФакт - ИнвентаризацияТоваровТовары.Вес КАК Вес
	|ИЗ
	|	Документ.ИнвентаризацияТоваров.Товары КАК ИнвентаризацияТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияТоваров КАК ИнвентаризацияТоваров
	|		ПО ИнвентаризацияТоваровТовары.Ссылка = ИнвентаризацияТоваров.Ссылка
	|ГДЕ
	|	ИнвентаризацияТоваровТовары.Ссылка = &Ссылка
	|	И ИнвентаризацияТоваровТовары.Количество - ИнвентаризацияТоваровТовары.КоличествоФакт < 0
	|	И ИнвентаризацияТоваров.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияТоваров.МестоХранения КАК МестоХранения,
	|	ИнвентаризацияТоваров.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ИнвентаризацияТоваров КАК ИнвентаризацияТоваров
	|ГДЕ
	|	ИнвентаризацияТоваров.Ссылка = &Ссылка
	|	И ИнвентаризацияТоваров.Проведен";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Товары.Загрузить(Результат[0].Выгрузить());

	Выборка = Результат[1].Выбрать();
	Выборка.Следующий();
	
	МестоХранения 		= Выборка.МестоХранения;
	ДокументОснование 	= Выборка.ДокументОснование;
	

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
